PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
/***************************************************************************//**
* \file cy_cryptolite_aes.c
* \version 2.80
*
* \brief
*  Provides API implementation of the Cryptolite AES PDL driver.
*
********************************************************************************
* \copyright
* Copyright (c) 2022, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#include "cy_cryptolite_aes.h"
#include "cy_cryptolite_vu.h"

#if defined(__cplusplus)
extern "C" {
#endif


#if (CRYPTOLITE_AES_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_AES_C)

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_ProcessBlock
****************************************************************************//*
*
* Performs the AES block cipher.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* the pointer to the cy_stc_cryptolite_aes_state_t structure that stores all
* internal variables for Cryptolite driver.
*
* \param dstBlock
* The pointer to the cipher text.
*
* \param srcBlock
* The pointer to the plain text. 4-Byte aligned buffer results in a faster operation!
*
* \return
* \ref cy_en_cryptolite_status_t
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_ProcessBlock(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_state_t *aesState,
        uint32_t *dstBlock,
        uint32_t const *srcBlock)
{
    bool isSrcAligned = false;
    bool isDstAligned = false;
    uint32_t src_ptr = (uint32_t)srcBlock;
    uint32_t dst_ptr = (uint32_t)dstBlock;

    /* Checking the address alignment */
    if (((uint32_t)srcBlock & 0x03U) == 0u)
    {
        isSrcAligned = true;
    }

    if (((uint32_t)dstBlock & 0x03U) == 0u)
    {
        isDstAligned = true;
    }

    if (isSrcAligned == false)
    {
        Cy_Cryptolite_Vu_memcpy(aesState->buffers->src, srcBlock, CY_CRYPTOLITE_AES_BLOCK_SIZE);
        src_ptr = (uint32_t)aesState->buffers->src;
    }

    if (isDstAligned == false)
    {
        Cy_Cryptolite_Vu_memcpy(aesState->buffers->dst, dstBlock, CY_CRYPTOLITE_AES_BLOCK_SIZE);
        dst_ptr = (uint32_t)aesState->buffers->dst;
    }

    aesState->message_encrypt_struct.plainText = (uint32_t)src_ptr;
    aesState->message_encrypt_struct.cipherText = (uint32_t)dst_ptr;

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) == 1U)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }

    REG_CRYPTOLITE_AES_DESCR(base) = (uint32_t) & (aesState->message_encrypt_struct);
    while ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) == 1U) {};

    if ((REG_CRYPTOLITE_INTR_ERROR(base) & CRYPTOLITE_INTR_ERROR_BUS_ERROR_Msk) == 1U)
    {
        REG_CRYPTOLITE_INTR_ERROR(base) = CRYPTOLITE_INTR_ERROR_BUS_ERROR_Msk;
        return CY_CRYPTOLITE_BUS_ERROR;
    }

    if (isSrcAligned == false)
    {
        Cy_Cryptolite_Vu_memcpy((void *)srcBlock, (const void *)aesState->buffers->src, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    }

    if (isDstAligned == false)
    {
        Cy_Cryptolite_Vu_memcpy((void *)dstBlock, (const void *)aesState->buffers->dst, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    }

    return CY_CRYPTOLITE_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Init
****************************************************************************//*
*
* Sets AES mode.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param key
* The pointer to the encryption/decryption key.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \param aesBuffers The buffers should be a SAHB mapped addresses.
* The pointer to the memory buffers storage.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Init(CRYPTOLITE_Type *base,
        uint8_t const *key,
        cy_stc_cryptolite_aes_state_t *aesState,
        cy_stc_cryptolite_aes_buffers_t *aesBuffers)
{
    (void)base;
    cy_en_cryptolite_status_t err = CY_CRYPTOLITE_BAD_PARAMS;
    uint32_t address_offset = 0u;
    uint8_t *keyRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == key) || (NULL == aesState) || (NULL == aesBuffers))
    {
        return err;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }


    keyRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key);

    /*Aligning the buffer address by 4 bytes*/
    if (((uint32_t)aesBuffers & 0x03U) != 0u)
    {
        address_offset = 4u - ((uint32_t)aesBuffers & 0x03U);
    }

    aesState->buffers = (cy_stc_cryptolite_aes_buffers_t *)((uint32_t)aesBuffers + address_offset);

    /* Copy the cipher block to the Initialization Vector */
    Cy_Cryptolite_Vu_memcpy((uint8_t *)aesState->buffers->key, keyRemap, CY_CRYPTOLITE_AES_128_KEY_SIZE);
    aesState->message_encrypt_struct.key = (uint32_t)aesState->buffers->key;

    return CY_CRYPTOLITE_SUCCESS;
}

