PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Free
****************************************************************************//*
*
* Clears AES operation context.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Free(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_state_t *aesState)
{
    (void)base;

    if (NULL != aesState)
    {
        if (NULL != aesState->buffers)
        {
            Cy_Cryptolite_Vu_memset((void *)aesState->buffers, 0u, sizeof(cy_stc_cryptolite_aes_buffers_t));
        }
        Cy_Cryptolite_Vu_memset((void *)aesState, 0u, sizeof(cy_stc_cryptolite_aes_state_t));
    }

    return CY_CRYPTOLITE_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ecb
****************************************************************************//*
*
* Performs an AES Encryption operation on one block.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
*
* \param dst
* The pointer to a destination cipher block, must be 4 byte aligned buffer results in a faster operation and should be a SAHB mapped addresses.
*
* \param src
* The pointer to a source block, must be 4 byte aligned results in a faster operation and should be a SAHB mapped addresses
*
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ecb(CRYPTOLITE_Type *base,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{

    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *srcRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == dst) || (NULL == src) || (NULL == aesState))
    {
        return status;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }


    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    status = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, (uint32_t*)((void*)dst), (uint32_t*)((void*)srcRemap));

    return status;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ecb_Setup
****************************************************************************//*
*
* Performs an AES ECB setup operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ecb_Setup(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesState->unProcessedBytes = 0u;

    return CY_CRYPTOLITE_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ecb_Update
****************************************************************************//*
*
* Performs an AES ECB Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param dstLength
* The size of the calculated cipher block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ecb_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        uint32_t *dstLength,
        cy_stc_cryptolite_aes_state_t *aesState)


{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint32_t bytes_to_copy = 0u;
    uint32_t outputLength = 0u;
    uint8_t *srcRemap;

    if (NULL == dstLength)
    {
        return status;
    }

    *dstLength = outputLength;

    if (0u == srcSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == src))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (((aesState->unProcessedBytes + srcSize) >= CY_CRYPTOLITE_AES_BLOCK_SIZE) && (NULL == dst))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    if (aesState->unProcessedBytes + srcSize < CY_CRYPTOLITE_AES_BLOCK_SIZE)
    {
        Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)srcSize);
        aesState->unProcessedBytes += srcSize;
        status = CY_CRYPTOLITE_SUCCESS;
    }
    else
    {
        if (aesState->unProcessedBytes > 0u)
        {
            bytes_to_copy = CY_CRYPTOLITE_AES_BLOCK_SIZE - aesState->unProcessedBytes;

            Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)bytes_to_copy);
            status = Cy_Cryptolite_Aes_Ecb(base, dst, (void*)aesState->buffers->unProcessedData, aesState);

            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }

            srcSize -= bytes_to_copy;
            srcRemap += bytes_to_copy;
            dst += CY_CRYPTOLITE_AES_BLOCK_SIZE;
            outputLength += CY_CRYPTOLITE_AES_BLOCK_SIZE;
            aesState->unProcessedBytes = 0u;
        }

        while (srcSize >= CY_CRYPTOLITE_AES_BLOCK_SIZE)
        {
            status = Cy_Cryptolite_Aes_Ecb(base, dst, srcRemap, aesState);

            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }

            dst += CY_CRYPTOLITE_AES_BLOCK_SIZE;
            srcRemap += CY_CRYPTOLITE_AES_BLOCK_SIZE;
            srcSize -= CY_CRYPTOLITE_AES_BLOCK_SIZE;
            outputLength += CY_CRYPTOLITE_AES_BLOCK_SIZE;
        }

        if (srcSize > 0u)
        {
            Cy_Cryptolite_Vu_memcpy((void*)aesState->buffers->unProcessedData, (void*)srcRemap, (uint16_t)srcSize);
            aesState->unProcessedBytes = srcSize;
        }
    }

