PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
    *dstLength = outputLength;

    return status;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ecb_Finish
****************************************************************************//*
*
* Performs an AES ECB finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ecb_Finish(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (aesState->unProcessedBytes > 0u)
    {
        return CY_CRYPTOLITE_BUFFER_NOT_ALIGNED;
    }

    return CY_CRYPTOLITE_SUCCESS;
}

#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cbc
****************************************************************************//*
*
* Performs AES Encryption operation on a plain text with Cipher Block Chaining (CBC).
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dst
* The pointer to a destination cipher text, must be 4 byte aligned buffer results in a faster operation and should be a SAHB mapped addresses.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cbc(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *ivPtr,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint32_t size = srcSize;
    cy_stc_cryptolite_aes_buffers_t *aesBuffers = NULL;
    uint32_t *srcBuff = NULL;
    uint32_t *dstBuff = NULL;
    uint32_t *tempBuff = NULL;
    uint8_t *srcRemap;
    uint8_t *ivRemap;

    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == ivPtr) || (NULL == dst) || (NULL == src) || (NULL == aesState))
    {
        return tmpResult;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);
    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(ivPtr);

    aesBuffers = (cy_stc_cryptolite_aes_buffers_t*)aesState->buffers;
    srcBuff  = (uint32_t*)((void *)srcRemap);
    dstBuff  = (uint32_t*)((void *)dst);
    tempBuff = (uint32_t*)(aesBuffers->block0);

    tmpResult = CY_CRYPTOLITE_SIZE_NOT_X16;

    /* Check whether the data size is multiple of CY_CRYPTOLITE_AES_BLOCK_SIZE */
    if (0UL == (uint32_t)(size & (CY_CRYPTOLITE_AES_BLOCK_SIZE - 1U)))
    {
        /* Copy the Initialization Vector to the local buffer because it changes during calculation */
        Cy_Cryptolite_Vu_memcpy((uint8_t *)tempBuff, ivRemap, CY_CRYPTOLITE_AES_BLOCK_SIZE);

        while (size != 0UL)
        {
            tempBuff[0] = srcBuff[0] ^ tempBuff[0];
            tempBuff[1] = srcBuff[1] ^ tempBuff[1];
            tempBuff[2] = srcBuff[2] ^ tempBuff[2];
            tempBuff[3] = srcBuff[3] ^ tempBuff[3];

            tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, dstBuff, tempBuff);

            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                break;
            }

            /* temporary cipher block */
            Cy_Cryptolite_Vu_memcpy(tempBuff, dstBuff, CY_CRYPTOLITE_AES_BLOCK_SIZE);

            srcBuff  += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
            size -= CY_CRYPTOLITE_AES_BLOCK_SIZE;

            if (aesState->isMac == false)
            {
                dstBuff  += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
            }

        }

        if (CY_CRYPTOLITE_SUCCESS == tmpResult)
        {
            /* Copy the cipher block to the Initialization Vector */
            Cy_Cryptolite_Vu_memcpy(ivRemap, tempBuff, CY_CRYPTOLITE_AES_BLOCK_SIZE);
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cbc_Setup
****************************************************************************//*
*
* Performs an AES CBC setup operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/

cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cbc_Setup(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesState->unProcessedBytes = 0u;
    aesState->isMac = false;

    return CY_CRYPTOLITE_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cbc_Set_IV
****************************************************************************//*
*
* Function to set AES CBC IV.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param iv
* The pointer to the IV.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/

cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cbc_Set_IV(CRYPTOLITE_Type *base,
        uint8_t const * iv,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == iv))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(iv);

    Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTOLITE_AES_BLOCK_SIZE);

    return CY_CRYPTOLITE_SUCCESS;
}


