PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cbc_Update
****************************************************************************//*
*
* Performs an AES CBC Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param dstLength
* The size of the calculated dst block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cbc_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        uint32_t *dstLength,
        cy_stc_cryptolite_aes_state_t *aesState)


{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint32_t bytes_to_copy = 0u;
    uint32_t cnt = 0u;
    uint32_t outputLength = 0u;
    uint8_t *srcRemap;

    if (NULL == dstLength)
    {
        return status;
    }

    *dstLength = outputLength;

    if (0u == srcSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == src))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (((aesState->unProcessedBytes + srcSize) >= CY_CRYPTOLITE_AES_BLOCK_SIZE) && (NULL == dst))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    if (aesState->unProcessedBytes + srcSize < CY_CRYPTOLITE_AES_BLOCK_SIZE)
    {
        Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)srcSize);
        aesState->unProcessedBytes += srcSize;
        status = CY_CRYPTOLITE_SUCCESS;
    }
    else
    {
        if (aesState->unProcessedBytes > 0u)
        {
            bytes_to_copy = CY_CRYPTOLITE_AES_BLOCK_SIZE - aesState->unProcessedBytes;

            if (srcSize < bytes_to_copy)
            {
                bytes_to_copy = srcSize;
            }

            Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)bytes_to_copy);

            status = Cy_Cryptolite_Aes_Cbc(base, CY_CRYPTOLITE_AES_BLOCK_SIZE, aesState->buffers->iv,
                                           dst, aesState->buffers->unProcessedData, aesState);
            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }
            srcSize -= bytes_to_copy;
            srcRemap += bytes_to_copy;
            aesState->unProcessedBytes = 0u;
            outputLength += CY_CRYPTOLITE_AES_BLOCK_SIZE;

            if (aesState->isMac == false)
            {
                dst += CY_CRYPTOLITE_AES_BLOCK_SIZE;
            }
        }

        cnt = (uint32_t)(srcSize / CY_CRYPTOLITE_AES_BLOCK_SIZE);

        if (cnt != 0u)
        {
            status = Cy_Cryptolite_Aes_Cbc(base, cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE, aesState->buffers->iv,
                                           dst, srcRemap, aesState);
            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }

            srcRemap += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
            srcSize -= cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
            outputLength += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
        }

        if ((srcSize > 0u) && (srcSize < CY_CRYPTOLITE_AES_BLOCK_SIZE))
        {
            Cy_Cryptolite_Vu_memcpy(aesState->buffers->unProcessedData, (void*)srcRemap, (uint16_t)srcSize);
            aesState->unProcessedBytes = srcSize;
        }
    }

    *dstLength = outputLength;

    return status;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cbc_Finish
****************************************************************************//*
*
* Performs an AES CBC finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cbc_Finish(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (aesState->unProcessedBytes > 0u)
    {
        return CY_CRYPTOLITE_BUFFER_NOT_ALIGNED;
    }

    return CY_CRYPTOLITE_SUCCESS;
}


#if defined(CY_CRYPTOLITE_CFG_CBC_MAC_C)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_CbcMac_Setup
****************************************************************************//*
*
* Performs an AES CBC MAC setup operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/

cy_en_cryptolite_status_t Cy_Cryptolite_Aes_CbcMac_Setup(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesState->unProcessedBytes = 0u;
    aesState->isMac = true;

    Cy_Cryptolite_Vu_memset((void*)&aesState->buffers->iv, 0u, (uint16_t)CY_CRYPTOLITE_AES_BLOCK_SIZE);
    return CY_CRYPTOLITE_SUCCESS;
}


