PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_CbcMac_Update
****************************************************************************//*
*
* Performs an AES CBC MAC Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_CbcMac_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)


{
    uint32_t dstLength;
    uint8_t *srcRemap;

    if (0u == srcSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == src))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    return Cy_Cryptolite_Aes_Cbc_Update(CRYPTOLITE,
                                        srcSize,
                                        aesState->buffers->temp,
                                        srcRemap,
                                        &dstLength,
                                        aesState);
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_CbcMac_Finish
****************************************************************************//*
*
* Performs an AES CBC MAC finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param mac
* The pointer to store the calculated mac.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_CbcMac_Finish(CRYPTOLITE_Type *base, uint8_t * mac, cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == mac))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (aesState->unProcessedBytes > 0u)
    {
        return CY_CRYPTOLITE_BUFFER_NOT_ALIGNED;
    }

    Cy_Cryptolite_Vu_memcpy(mac, aesState->buffers->iv, (uint16_t)CY_CRYPTOLITE_AES_BLOCK_SIZE);

    return CY_CRYPTOLITE_SUCCESS;
}

#endif /*CY_CRYPTOLITE_CFG_CBC_MAC_C*/

#endif /*CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC*/


#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CFB)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb
********************************************************************************
*
* Performs AES Encryption/Decryption operation on a data with the Cipher Feedback Block method (CFB).
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param dirMode
* Can be \ref CY_CRYPTOLITE_ENCRYPT or \ref CY_CRYPTOLITE_DECRYPT
* (\ref cy_en_cryptolite_dir_mode_t)
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user must
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb(CRYPTOLITE_Type *base,
        cy_en_cryptolite_dir_mode_t dirMode,
        uint32_t srcSize,
        uint8_t *ivPtr,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint32_t size = srcSize;
    uint32_t *srcBuff = NULL;
    uint32_t *dstBuff = NULL;
    uint32_t *tempBuff = NULL;
    uint32_t *tempBuff1 = NULL;

    uint8_t *srcRemap;
    uint8_t *ivRemap;

    cy_stc_cryptolite_aes_buffers_t *aesBuffers = NULL;
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == ivPtr) || (NULL == dst) || (NULL == src) || (NULL == aesState))
    {
        return tmpResult;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }

    srcRemap  = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);
    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(ivPtr);

    tmpResult = CY_CRYPTOLITE_SIZE_NOT_X16;

    aesBuffers = (cy_stc_cryptolite_aes_buffers_t*)aesState->buffers;
    srcBuff  = (uint32_t*)((void *)srcRemap);
    dstBuff  = (uint32_t*)((void *)dst);
    tempBuff = (uint32_t*)(aesBuffers->block0);
    tempBuff1 = (uint32_t*)(aesBuffers->block1);

    /* Check whether the data size is multiple of CY_CRYPTOLITE_AES_BLOCK_SIZE */
    if (0UL == (size & (CY_CRYPTOLITE_AES_BLOCK_SIZE - 1U)))
    {

        /* Copies the Initialization Vector to the local encode buffer. */
        Cy_Cryptolite_Vu_memcpy(tempBuff, ivRemap, CY_CRYPTOLITE_AES_BLOCK_SIZE);

        while (size != 0UL)
        {
            /* In this mode, (CFB) is always an encryption! */
            tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, tempBuff1, tempBuff);

            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                break;
            }
            Cy_Cryptolite_Vu_memcpy(tempBuff, tempBuff1, CY_CRYPTOLITE_AES_BLOCK_SIZE);

            // Cy_Cryptolite_Aes_Xor(base, aesState, dstBuff, srcBuff, dstBuff);
            dstBuff[0] = srcBuff[0] ^ tempBuff[0];
            dstBuff[1] = srcBuff[1] ^ tempBuff[1];
            dstBuff[2] = srcBuff[2] ^ tempBuff[2];
            dstBuff[3] = srcBuff[3] ^ tempBuff[3];

            if (CY_CRYPTOLITE_DECRYPT == dirMode)
            {
                /* cipher text block */
                Cy_Cryptolite_Vu_memcpy(tempBuff, srcBuff, CY_CRYPTOLITE_AES_BLOCK_SIZE);
            }
            else
            {
                /* cipher text block */
                Cy_Cryptolite_Vu_memcpy(tempBuff, dstBuff, CY_CRYPTOLITE_AES_BLOCK_SIZE);
            }

            srcBuff  += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
            dstBuff  += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;

            size -= CY_CRYPTOLITE_AES_BLOCK_SIZE;
        }

        if (CY_CRYPTOLITE_SUCCESS == tmpResult)
        {
            /* Copies the local encode buffer to the Initialization Vector. */
            Cy_Cryptolite_Vu_memcpy(ivRemap, tempBuff, CY_CRYPTOLITE_AES_BLOCK_SIZE);
        }
    }

    return (tmpResult);
}


