PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Setup
****************************************************************************//*
*
* Performs an AES CFB setup operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTOLITE_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_cryptolite_dir_mode_t).
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Setup(CRYPTOLITE_Type *base,
        cy_en_cryptolite_dir_mode_t dirMode,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesState->dirMode = dirMode;
    aesState->unProcessedBytes = 0u;

    return CY_CRYPTOLITE_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Set_IV
****************************************************************************//*
*
* Sets IV for AES CFB mode.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param iv
* The pointer to iv.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Set_IV(CRYPTOLITE_Type *base,
        uint8_t const * iv,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == iv))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(iv);

    Cy_Cryptolite_Vu_memcpy((void*)&aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTOLITE_AES_BLOCK_SIZE);

    return CY_CRYPTOLITE_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Update
****************************************************************************//*
*
* Performs an AES CFB Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint32_t bytes_rem = 0u;
    uint32_t cnt = 0u;
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_SIZE_NOT_X16;
    uint8_t *srcRemap;

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    if (aesState->unProcessedBytes != 0u)
    {
        bytes_rem = CY_CRYPTOLITE_AES_BLOCK_SIZE - aesState->unProcessedBytes;

        if (srcSize < bytes_rem)
        {
            bytes_rem = srcSize;
        }

        for (uint32_t i = 0u; i < bytes_rem ; i++)
        {
            dst[i] = srcRemap[i] ^ aesState->buffers->unProcessedData[aesState->unProcessedBytes + i];
        }

        if (aesState->dirMode == CY_CRYPTOLITE_ENCRYPT)
        {
            Cy_Cryptolite_Vu_memcpy(&aesState->buffers->iv[aesState->unProcessedBytes], dst, (uint16_t)bytes_rem);
        }
        else
        {
            Cy_Cryptolite_Vu_memcpy(&aesState->buffers->iv[aesState->unProcessedBytes], srcRemap, (uint16_t)bytes_rem);
        }

        aesState->unProcessedBytes += bytes_rem;
        srcSize -= bytes_rem;
        srcRemap += bytes_rem;
        dst += bytes_rem;

        if (aesState->unProcessedBytes == CY_CRYPTOLITE_AES_BLOCK_SIZE)
        {
            aesState->unProcessedBytes = 0;
        }

        tmpResult = CY_CRYPTOLITE_SUCCESS;
    }

    cnt = (uint32_t)(srcSize / CY_CRYPTOLITE_AES_BLOCK_SIZE);

    if (cnt != 0u)
    {
        tmpResult = Cy_Cryptolite_Aes_Cfb(base, aesState->dirMode, cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE,
                                          aesState->buffers->iv, dst, srcRemap, aesState);

        if (CY_CRYPTOLITE_SUCCESS != tmpResult)
        {
            return tmpResult;
        }
        srcSize -= cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
        srcRemap += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
        dst += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
    }

    if (srcSize > 0u)
    {
        tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, (uint32_t*)((void*)aesState->buffers->unProcessedData), (uint32_t*)((void*)aesState->buffers->iv));

        for (uint32_t i = 0u; i < srcSize ; i++)
        {
            dst[i] = srcRemap[i] ^ aesState->buffers->unProcessedData[i];
        }

        if (aesState->dirMode == CY_CRYPTOLITE_ENCRYPT)
        {
            Cy_Cryptolite_Vu_memcpy(&aesState->buffers->iv, dst, (uint16_t)srcSize);
        }
        else
        {
            Cy_Cryptolite_Vu_memcpy(&aesState->buffers->iv, srcRemap, (uint16_t)srcSize);
        }

        aesState->unProcessedBytes += srcSize;
        srcSize -= bytes_rem;

        tmpResult = CY_CRYPTOLITE_SUCCESS;
    }
    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Finish
****************************************************************************//*
*
* Performs an AES CFB finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Finish(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    return CY_CRYPTOLITE_SUCCESS;
}

#endif /*CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC*/



#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CTR)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr
********************************************************************************
*
* Performs an AES Encryption/Decryption operation on a data using the counter method (CTR).
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of a source plain text.
*
* \param srcOffset
* The size of an offset within the current block stream for resuming within the
* current cipher stream.
*
* \param ivPtr
* The 128-bit initial vector that contains a 64-bit nonce and 64-bit counter.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user must
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint32_t *srcOffset,
        uint8_t  *ivPtr,
        uint8_t  *dst,
        uint8_t  const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint32_t i;
    uint32_t cnt;
    uint64_t counter;
    uint32_t *blockCounter = NULL;
    cy_stc_cryptolite_aes_buffers_t *aesBuffers = NULL;
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
    uint32_t *srcBuff = NULL;
    uint32_t *dstBuff = NULL;
    uint32_t *streamBuff = NULL;
    uint8_t *srcRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == srcOffset) || (NULL == ivPtr) || (NULL == dst) || (NULL == src) || (NULL == aesState))
    {
        return tmpResult;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }

