PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    aesBuffers = (cy_stc_cryptolite_aes_buffers_t*)aesState->buffers;
    srcBuff  = (uint32_t*)((void *)srcRemap);
    dstBuff  = (uint32_t*)((void *)dst);
    streamBuff = (uint32_t*)(aesBuffers->block2);
    blockCounter = (uint32_t*)(aesBuffers->block3);

    Cy_Cryptolite_Vu_memcpy(blockCounter, ivPtr, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
    counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS));

    cnt = (uint32_t)(srcSize / CY_CRYPTOLITE_AES_BLOCK_SIZE);

    for (i = 0UL; i < cnt; i++)
    {

        /* In this mode, (CTR) is always an encryption! */
        tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, (uint32_t*)((void*)streamBuff), (uint32_t*)((void*)blockCounter));

        if (CY_CRYPTOLITE_SUCCESS != tmpResult)
        {
            break;
        }
        /* Increment the block counter, at least 64Bits (from 128) is the counter part */
        counter++;
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
        *(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS) = CY_SWAP_ENDIAN64(counter);

        // Cy_Cryptolite_Aes_Xor(base, aesState, dstBuff, srcBuff, streamBuff);
        dstBuff[0] = srcBuff[0] ^ streamBuff[0];
        dstBuff[1] = srcBuff[1] ^ streamBuff[1];
        dstBuff[2] = srcBuff[2] ^ streamBuff[2];
        dstBuff[3] = srcBuff[3] ^ streamBuff[3];

        srcBuff += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
        dstBuff += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
    }

    if (CY_CRYPTOLITE_SUCCESS == tmpResult)
    {

        Cy_Cryptolite_Vu_memcpy(ivPtr, blockCounter, CY_CRYPTOLITE_AES_BLOCK_SIZE);

        /* Save the reminder of the last non-complete block */
        *srcOffset = (uint32_t)(srcSize % CY_CRYPTOLITE_AES_BLOCK_SIZE);
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr_Setup
****************************************************************************//*
*
* Performs an AES CTR setup operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr_Setup(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == aesState->buffers))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesState->unProcessedBytes = 0u;
    return CY_CRYPTOLITE_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr_Set_IV
****************************************************************************//*
*
* Sets IV for the AES CTR operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param iv
* The pointer to iv.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr_Set_IV(CRYPTOLITE_Type *base,
        const uint8_t *iv,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == iv) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(iv);

    Cy_Cryptolite_Vu_memcpy((void*)aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTOLITE_AES_BLOCK_SIZE);
    return CY_CRYPTOLITE_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr_Update
****************************************************************************//*
*
* Performs an AES CTR Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_state_t *aesState)


{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *srcRemap;

    if (0u == srcSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == dst) || (NULL == src))
    {
        return status;
    }


    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    uint32_t blockCounter[CY_CRYPTOLITE_AES_BLOCK_SIZE_U32] = { 0UL };
    uint64_t counter;
    uint32_t cnt;
    uint32_t srcOffset;

    Cy_Cryptolite_Vu_memcpy(blockCounter, aesState->buffers->iv, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
    counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS));

    while (srcSize > 0u)
    {
        cnt = (uint32_t)(srcSize / CY_CRYPTOLITE_AES_BLOCK_SIZE);

        if (aesState->unProcessedBytes == 0u && cnt == 0u)
        {
            status = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, (uint32_t*)((void*)aesState->buffers->unProcessedData), blockCounter);
            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }
            Cy_Cryptolite_Vu_memcpy(aesState->buffers->iv, blockCounter, CY_CRYPTOLITE_AES_BLOCK_SIZE);

            counter++;
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
            *(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS) = CY_SWAP_ENDIAN64(counter);
        }

        if (aesState->unProcessedBytes == 0u && cnt > 0u)
        {
            status = Cy_Cryptolite_Aes_Ctr(CRYPTOLITE, cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE, &srcOffset, aesState->buffers->iv, dst, srcRemap, aesState);
            if (CY_CRYPTOLITE_SUCCESS != status)
            {
                return status;
            }

            srcSize -= cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
            srcRemap += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;
            dst += cnt * CY_CRYPTOLITE_AES_BLOCK_SIZE;

            Cy_Cryptolite_Vu_memcpy(blockCounter, aesState->buffers->iv, CY_CRYPTOLITE_AES_BLOCK_SIZE);
            continue;
        }


        *dst++ = *srcRemap++ ^ aesState->buffers->unProcessedData[aesState->unProcessedBytes];
        aesState->unProcessedBytes = (aesState->unProcessedBytes + 1u) & 0x0Fu;
        --srcSize;
        status = CY_CRYPTOLITE_SUCCESS;

