PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes.c
    }

    Cy_Cryptolite_Vu_memcpy(aesState->buffers->iv, blockCounter, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    return status;
}
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr_Finish
****************************************************************************//*
*
* Performs an AES CTR Finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr_Finish(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    return CY_CRYPTOLITE_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ctr_Zeropad
********************************************************************************
*
* Performs an AES Encryption operation with zero bytes padding for the last block(Not multiple of Aes block size) using the counter method (CTR).
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of a source plain text.
*
* \param srcOffset
* The size of an offset within the current block stream for resuming within the
* current cipher stream.
*
* \param ivPtr
* The 128-bit initial vector that contains a 64-bit nonce and 64-bit counter.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user must
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ctr_Zeropad(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t  *ivPtr,
        uint8_t  *dst,
        uint8_t  const *src,
        cy_stc_cryptolite_aes_state_t *aesState)
{
    uint32_t i;
    uint32_t cnt;
    uint64_t counter;
    uint32_t *blockCounter = NULL;
    cy_stc_cryptolite_aes_buffers_t *aesBuffers = NULL;
    uint32_t *srcBuff = NULL;
    uint32_t *dstBuff = NULL;
    uint32_t *streamBuff = NULL;
    uint32_t *tempBuf = NULL;
    uint32_t *tempBuf1 = NULL;
    uint8_t *srcRemap;
    uint32_t srcRemainder = 0;

    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_SUCCESS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == ivPtr) || (NULL == dst) || (NULL == src) || (NULL == aesState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    /*check if IP is busy*/
    if ((REG_CRYPTOLITE_STATUS(base) & CRYPTOLITE_STATUS_BUSY_Msk) != 0UL)
    {
        return CY_CRYPTOLITE_HW_BUSY;
    }

    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    aesBuffers = (cy_stc_cryptolite_aes_buffers_t*)aesState->buffers;
    srcBuff      = (uint32_t*)((void*)srcRemap);
    dstBuff      = (uint32_t*)((void*)dst);
    streamBuff   = (uint32_t*)(aesBuffers->block0);
    tempBuf   = (uint32_t*)(aesBuffers->block1);
    tempBuf1   = (uint32_t*)(aesBuffers->block2);
    blockCounter = (uint32_t*)(aesBuffers->block3);

    Cy_Cryptolite_Vu_memcpy(blockCounter, ivPtr, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
    counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS));

    cnt = (uint32_t)(srcSize / CY_CRYPTOLITE_AES_BLOCK_SIZE);

    for (i = 0UL; i < cnt; i++)
    {

        /* In this mode, (CTR) is always an encryption! */
        tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, streamBuff, blockCounter);

        if (CY_CRYPTOLITE_SUCCESS != tmpResult)
        {
            break;
        }
        /* Increment the block counter, at least 64Bits (from 128) is the counter part */
        counter++;
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
        *(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS) = CY_SWAP_ENDIAN64(counter);

        // Cy_Cryptolite_Aes_Xor(base, aesState, dstBuff, srcBuff, streamBuff);
        dstBuff[0] = srcBuff[0] ^ streamBuff[0];
        dstBuff[1] = srcBuff[1] ^ streamBuff[1];
        dstBuff[2] = srcBuff[2] ^ streamBuff[2];
        dstBuff[3] = srcBuff[3] ^ streamBuff[3];

        srcBuff += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
        dstBuff += CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32;
    }

    srcRemainder = (uint32_t)(srcSize % CY_CRYPTOLITE_AES_BLOCK_SIZE);

    if ((srcRemainder != 0u) && (CY_CRYPTOLITE_SUCCESS == tmpResult))
    {
        /* source message block */
        Cy_Cryptolite_Vu_memcpy(tempBuf, srcBuff, srcRemainder);

        /* zeropad source message block */
        Cy_Cryptolite_Vu_memset((uint8_t*)tempBuf + srcRemainder, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE - srcRemainder);

        /* In this mode, (CTR) is always an encryption! */
        tmpResult = Cy_Cryptolite_Aes_ProcessBlock(base, aesState, streamBuff, blockCounter);

        if (CY_CRYPTOLITE_SUCCESS == tmpResult)
        {
            /* Increment the block counter, at least 64Bits (from 128) is the counter part */
            counter++;
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional pointer type conversion');
            *(uint64_t*)(blockCounter + CY_CRYPTO_AES_CTR_CNT_POS) = CY_SWAP_ENDIAN64(counter);

            // Cy_Cryptolite_Aes_Xor(base, aesState, dstBuff, srcBuff, streamBuff);
            tempBuf1[0] = tempBuf[0] ^ streamBuff[0];
            tempBuf1[1] = tempBuf[1] ^ streamBuff[1];
            tempBuf1[2] = tempBuf[2] ^ streamBuff[2];
            tempBuf1[3] = tempBuf[3] ^ streamBuff[3];

            /* destination cipher text block */
            Cy_Cryptolite_Vu_memcpy(dstBuff, tempBuf1, srcRemainder);
        }

    }

    if (CY_CRYPTOLITE_SUCCESS == tmpResult)
    {
        Cy_Cryptolite_Vu_memcpy(ivPtr, blockCounter, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    }

    return tmpResult;
}

#endif /*CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC*/

#endif
#endif

#if defined(__cplusplus)
}
#endif


#endif /* CY_IP_MXCRYPTOLITE */


/* [] END OF FILE */
